pd_disagg/hw/20260915T0335_nccl_h2_loadgen_bench.log
# provenance: env=ENV-B sha=752a3a5044 cmd="vllm bench serve --host localhost --port 8300 --model Qwen/Qwen2-7B-Instruct --dataset-name random --random-input-len 512 --random-output-len 128 --num-prompts 1200 --ignore-eos --seed 7777 --max-concurrency 128 --request-rate inf" date=2026-09-15T03:35:45+00:00 gpu="RTX 4090 x2" driver=610.57.04 exp=EXP-020-appendixB note=负载发生器-非测量点-不进runs.jsonl
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x718ae498a840>, trust_remote_code=False, seed=7777, num_prompts=1200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8300, endpoint='/v1/completions', header=None, max_concurrency=128, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-475ee02e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-15 03:36:01 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 1200/1200 [00:55<00:00, 21.46it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1200      
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  55.92     
Total input tokens:                      614400    
Total generated tokens:                  153600    
Request throughput (req/s):              21.46     
Output token throughput (tok/s):         2747.00   
Peak output token throughput (tok/s):    6272.00   
Peak concurrent requests:                174.00    
Total token throughput (tok/s):          13734.99  
---------------Time to First Token----------------
Mean TTFT (ms):                          522.52    
Median TTFT (ms):                        309.91    
P99 TTFT (ms):                           3239.82   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.69     
Median TPOT (ms):                        40.80     
P99 TPOT (ms):                           52.04     
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.69     
Median ITL (ms):                         22.27     
P99 ITL (ms):                            209.44    
==================================================